
&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
  Время = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
  Сообщить("HTML"+Время);
  
  Время = ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартФормы;
  Сообщить("Форма:"+Время);
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриИзменении(Элемент)
  // Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  СтартФормы = ТекущаяУниверсальнаяДатаВМиллисекундах();
  
  ОбработкаОБъект = РеквизитФормыВЗначение("Объект");
  
  ДвоичныеДанныеАрхива = ОбработкаОБъект.ПолучитьМакет("ace_zip");
  
  ЧтениеZIP = Новый ЧтениеZipФайла(ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения());
  
  КаталогРаспаковки = ПолучитьИмяВременногоФайла("Ace");
  СоздатьКаталог(КаталогРаспаковки);
  
  ЧтениеZIP.ИзвлечьВсе(КаталогРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать);
  
  ФайлыКаталога = НайтиФайлы(КаталогРаспаковки,ПолучитьМаскуВсеФайлы());
  
  Стили = Новый Массив;
  Скрипты = Новый Массив;
  
  Для Каждого ТекФайл Из ФайлыКаталога Цикл
    Если НРег(ТекФайл.Расширение) = ".js" Тогда
      Скрипты.Добавить(Новый ДвоичныеДанные(ТекФайл.ПолноеИмя));
    ИначеЕсли НРег(ТекФайл.Расширение) = ".css" Тогда
      Стили.Добавить(Новый ДвоичныеДанные(ТекФайл.ПолноеИмя));
    КонецЕсли;
  КонецЦикла;
  
  ТекстHTML =
  "<!doctype html>
  |<html lang=""ru"">
  |
  |<head>
  |  <meta charset=""UTF-8"" />
  |  <meta name=""viewport"" content=""width=device-width,initial-scale=1"" />
  |  <meta http-equiv=""X-UA-Compatible"" content=""ie=edge"" />
  |  <title>Ace editor for 1C</title>
  |";
  
  Для Каждого ТекСтиль Из Стили Цикл
    ТекстСтиля = Новый ТекстовыйДокумент;
    ТекстСтиля.Прочитать(ТекСтиль.ОткрытьПотокДляЧтения());
    ТекстHTML=ТекстHTML+"
    |	 <style>
    |    "+ТекстСтиля.ПолучитьТекст()+"
    |    </style>";
  КонецЦикла;
  
  ТекстHTML=ТекстHTML+"
  |</head>
  |
  |<body>
  |  <div id=""editor""></div>
  |  <div id=""statusBar""></div>
  |";
  
  //Для Каждого ТекСтиль Из Стили Цикл
  //	//ТекстHTML=ТекстHTML+"
  //	//|	 <style>
  //	//|    "+ТекстСтиля.ПолучитьТекст()+"
  //	//|    </style>";
  //	ТекстHTML = ТекстHTML+"
  //	|<link href="""+ПоместитьВоВременноеХранилище(ТекСтиль,УникальныйИдентификатор)+""" rel=""stylesheet"">";
  //КонецЦикла;
  
  Для Каждого ТекСкрипт Из Скрипты Цикл
    ТекстHTML=ТекстHTML+"
    |  <script src="""+ПоместитьВоВременноеХранилище(ТекСкрипт,УникальныйИдентификатор)+""" defer></script>";
  КонецЦикла;
  
  ТекстHTML= ТекстHTML+"
  |</body>
  |
  |</html>";
  
  ПолеHTML = ТекстHTML;
  Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
КонецПроцедуры
